Revit 2027 API
IntersectionResult.Parameter Property
1d parameter of the point of intersection.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Parameter { get; }
Public ReadOnly Property Parameter As Double
	Get
public:
property double Parameter {
	double get ();
}
member Parameter : float with get
Property Value
Double
Exceptions
Exception | Condition
InvalidOperationException |  Thrown in the getter when this property has not been set by the method providing the result.
See Also
Reference
IntersectionResult Class
Autodesk.Revit.DB Namespace